Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: To illustrate the workflow, we'll make a very simple project which will make a ball bounce around a room.
zh_cn: 为了说明整个工作流程，我们将做一个非常简单的项目，让一个球在房间里弹跳。

source: To import this resource, upgrade its project by loading it once.
zh_cn: 为导入这个资源，重新载入一次更新这个项目。

source: To prevent this you can set this option to "Show message" (the default option) to ask if you really want to close that empty tab.
zh_cn: 为了防止这种情况，你可以将该选项设置为“显示消息”（Show message，也是默认选项）来询问你是否真的想要关掉那个选项卡。

source: To prevent this you can use various different cloud services, which offer data storage over the internet for retrieval and modification at any time.
zh_cn: 为了防止这种情况的出现您可以使用各种不同的云服务 ，用来提供可以修改和检索数据的云端据存储服务。

source: To purchase Spine, please visit
zh_cn: 购买 Spine，请访问

source: To rectify this we should have formatted the code as follows:
zh_cn: 为纠正这一点，重写代码如下：

source: To select a different runtime to use, simply find it in the list and then double click on it.
zh_cn: 要选择不同的运行库使用，只需在列表中找到它，然后双击 它。

source: To select a target, simply click on it.
zh_cn: 要选择一个目标只需点击 它。

source: To set this up, you will need to know a couple of things beforehand.
zh_cn: 要使用该参数，你需要先知道一些事情。

source: To start with we need to initialise our surface variable in the Create Event of a controller instance:
zh_cn: 首先我们需要在创建事件（Create Event）中初始化表面变量。

source: To start with you will need the path to the Runner itself.
zh_cn: 你首先需要找到 Runner 的路径。

source: To start with, we need to have a tile set image, which would be done in the sprite editor/image editor, and the final sprite would look something like this:
zh_cn: 首先，我们需要一个图块集的图像，可以在精灵编辑器/图像编辑器中完成，最终的精灵看起来像是这样：

source: To the right of that you have the Switch To section where you can select a new runtime to switch to from the drop down list:
zh_cn: 在右边你可以看到切换到部分，你可以从下拉列表中选择一个新的运行库来切换。

source: To understand this better, take, for example, an action (or a code in GML) and think about how it works... you place it in an event and specify a number of parameters and it will make your instance do something.
zh_cn: 为了让你更好的理解，让我们拿对象的一个动作来举个例子：你把动作添加到事件中，同时指定好一些相应的参数，那么你的实例就会执行你设置的动作。To understand this better, take, for example, an action (or a code in GML) and think about how it works... you place it in an event and specify a number of parameters and it will make your instance do something.

source: To understand this better, take, for example, an action and think about how it works... you place it in an event and specify a number of parameters and it will make your instance do something.
zh_cn: 为了更好的理解这件事，举个例子，就拿一个动作然后考虑它是如何工作的……你把它放到事件当中，然后指定了一些参数，然后它就会让你的实例做某些事情。

source: To use Android simulators, Run AVD then Create and Start them before detecting
zh_cn: 要使用Android模拟器，请运行AVD，然后在检测之前创建并启动它们

source: To use Spine animations with GameMaker, please agree to the license above.
zh_cn: 要在GameMaker中使用Spine动画，请同意上述许可。

source: To view release notes for this and previous versions
zh_cn: 查看此版本和之前版本的发行说明

source: To view the release notes for this and previous versions
zh_cn: 查看当前及以前版本的版本说明

source: Toggle
zh_cn: 切换

source: Toggle Breakpoint
zh_cn: 开/关断点

source: Toggle Button
zh_cn: 开关按钮

source: Toggle Enabled
zh_cn: 切换启用

source: Toggle Grid
zh_cn: 切换网格

source: Toggle Grid (G)
zh_cn: 切换网格显示(G)

source: Toggle Grid On/Off
zh_cn: 切换网格开启/关闭

source: Toggle Replace
zh_cn: 切换为替换

source: Toggle a region between folded/unfolded states
zh_cn: 将区域状态在折叠/展开之间切换

source: Toggle animation playback off/on
zh_cn: 开/关动画播放器

source: Toggle between the preset and the selection brush
zh_cn: 在预设画刷和选区画刷之间切换

source: Toggle colour picker tool while held down
zh_cn: 按下时切换为取色器

source: Toggle enabled/disabled for selected actions
zh_cn: 启用/禁用选定的动作

source: Toggle extra platforms
zh_cn: 切换额外的平台

source: Toggle grid on or off.
zh_cn: 开启或关闭网格。

source: Toggle grid snap
zh_cn: 切换网格吸附

source: Toggle grid snap on/off
zh_cn: 开/关网格吸附

source: Toggle horizontal split view
zh_cn: 切换水平分屏

source: Toggle loop/ping-pong
zh_cn: 切换 循环/往返

source: Toggle onion skinning
zh_cn: 切换洋葱皮模式

source: Toggle ping-pong animation playback off/on
zh_cn: 切换动画播放器的往返播放

source: Toggle vertical split view
zh_cn: 切换垂直分屏

source: Toggle vertical synchronisation to on (true) or off (false).
zh_cn: 切换垂直同步为开启（真）或关闭（假）

source: Toggles the grid overlay
zh_cn: 切换网格覆盖

source: Tolerance
zh_cn: 容差

source: Tolerance:
zh_cn: 容差：

source: Too Many Sound Mixer Groups
zh_cn: 混音器组过多

source: Too many errors - GML not processed : {0}
zh_cn: 错误过多 - GML 未处理: {0}

source: Tool Options
zh_cn: 工具选项

source: Tool location
zh_cn: 工具位置

source: Tool options
zh_cn: 工具选项

source: Tool:
zh_cn: 工具：

source: Toolbox
zh_cn: 工具箱

source: Tools > Generate Project Images can help quickly fix this.
zh_cn: Tools > Generate 项目图像可以帮助您快速解决此问题。

source: Tools Menu
zh_cn: 工具菜单

source: Tools will automatically update when there is a new version available, but you can then use the Runtime Feeds Preferences to select which ones you actually want to use.
zh_cn: 工具会在有新版本可用的时候自动更新，但你也可以在以后使用运行环境引入设置里选择你实际要用的版本。

source: Top
zh_cn: 顶

source: Top Center
zh_cn: 中上

source: Top Centre
zh_cn: 中上

source: Top Edge
zh_cn: 上边界

source: Top Left
zh_cn: 左上

source: Top Right
zh_cn: 右上

source: Top Shelf
zh_cn: 顶栏(?)

source: Top Shelf Image
zh_cn: 顶栏图像

source: Top Shelf Image 2x
zh_cn: 顶栏图像 2x

source: Top Shelf Image Wide
zh_cn: 顶栏图像宽

source: Top Shelf Image Wide 2x
zh_cn: 顶栏图像宽 2x

source: Top-down
zh_cn: 自上而下

source: Top:
zh_cn: 顶：

source: Touch Screen Support
zh_cn: 触控屏支持

source: Translation
zh_cn: 翻译

source: Translations
zh_cn: 翻译

source: Transparent background block size (block pattern style)
zh_cn: 透明背景块大小 (块图案样式)

source: Transparent background colour 1
zh_cn: 透明背景颜色 1

source: Transparent background colour 2 (block pattern style)
zh_cn: 透明背景颜色 2 (块图案样式)

source: Transparent background style
zh_cn: 透明背景样式

source: Tree View
zh_cn: 树视图

source: Tree View Node
zh_cn: 树形图节点

source: Tree line colour
zh_cn: 树状线颜色

source: TreeViewNode
zh_cn: 树形视图节点

source: Trial
zh_cn: 试用版（Trial）

source: Tried to load an image that was too large.
zh_cn: 试图载入的图片太大。

source: Trigger
zh_cn: 触发器

source: Trophy Editor
zh_cn: 奖杯编辑器

source: Trophy Screen
zh_cn: 奖杯界面

source: Trophy editor not available on Mac.\nPlease edit on Windows and copy to {0}/options/ps4/sce_sys/trophy/trophy00.trp
zh_cn: 奖杯编辑器在Mac上不可用。\n请在Windows系统中编辑并且复制到 {0}/options/ps4/sce_sys/trophy/trophy00.trp

source: Try again later.
zh_cn: 稍后重试。

source: Trying to free invalid memory block
zh_cn: 尝试释放无效的内存块

source: Tutorial
zh_cn: 教程

source: Tutorial Content Settings will appear here when 'Tutorial' Package Type has been selected
zh_cn: 当“教程”包被选中时，教程内容设置将出现在这里

source: Tutorial Content Settings:
zh_cn: 教程内容设置：

source: Tutorial Package Detected
zh_cn: 检测到教程包

source: Tutorial Windows
zh_cn: 教程窗口

source: Tutorial install complete!
zh_cn: 教程安装完成！

source: Tutorial package detected
zh_cn: 教程包检测

source: Tutorial: {0}
zh_cn: 教程：{0}

source: Tutorials
zh_cn: 教程

source: Tutorials and Demos
zh_cn: 教程和演示项目

source: Tutorials, marketplace, support and much more
zh_cn: 教程、市场、支持……还远不止这些

source: Tutorials, support and much more
zh_cn: 教程、帮助支持或更多

source: Two Step Authentication
zh_cn: 两步认证

source: Two-step code invalid
zh_cn: 两步验证码无效

source: Two-step login required
zh_cn: 两步登录要求

source: Type
zh_cn: 类型

source: Type in the keyword to find:
zh_cn: 输入查找的关键字：

source: Type in the word(s) to search for:
zh_cn: 输入查找的词语：

source: Type of Tiles to display
zh_cn: 显示的图块类型

source: Type to find resource
zh_cn: 输入以查找资源

source: Type: {0}
zh_cn: 类型: {0}

source: Types
zh_cn: 类型

source: Typically a remote push notification would just indicate that new data is available from your server for example.
zh_cn: 举个例子，通常一个远程推送式通知就表明服务器上有新的数据。

source: Typically it is used to avoid an instance running a specific block of code in, for example a collision event.
zh_cn: 通常它是用来避免运行一个特定的代码块，比如碰撞事件。

source: URL must be unique and not empty
zh_cn: 网址必须唯一且不为空

source: URL of repository to clone:
zh_cn: 要克隆的存储库的URL：

source: Un checking this message will suppress that message and force GameMaker Studio 2 to assume you had clicked "Okay" as a response.
zh_cn: 解除勾选此项会抑制该消息的产生并强制GameMaker Studio 2认为你已经点击“确认”（Okay）作为回应了。

source: Un-checking this option will force them to open each in their own window/workspace.
zh_cn: 不勾选这个选项将强制他们在他们的工作区中分别打开。

source: Un-checking this option will make each event open as its own unique chained window.
zh_cn: 不勾选这个选项将使得每一个打开的事件作为独立的链接窗口打开。

source: Un-checking this will make the output smaller and have less information.
zh_cn: 取消勾选该选项会使得输出内容更简短，信息量更少。

source: Un-checking this will prevent the splash screen from showing.
zh_cn: 解除此项会阻止该画面的显示

source: Un-select all moments
zh_cn: 解选所有时刻

source: Unable to Login - Cannot reach https://accounts.yoyogames.com
zh_cn: 无法登录 - 无法访问 https://accounts.yoyogames.com

source: Unable to access the Runtime Feed and no local Runtime installed.
zh_cn: 无法访问运行库源（Runtime Feed）并且未安装本地运行库。

source: Unable to drag resources into room, ensure one layer is selected
zh_cn: 无法将资源拖到房间中，请确保选中一个图层

source: Unable to drag resources into room, ensure selected layer '{0}' is unlocked and visible
zh_cn: 无法将资源拖拽到房间，确保选中的层 '{0}'未锁定并可见

source: Unable to find PlayStation 4 param.sfo editor, please update your tools directory
zh_cn: 无法找到 PlayStation 4 的 param.sfo 编辑器，请更新您的工具目录

source: Unable to find PlayStation 4 share file editor, please update your tools directory
zh_cn: 无法找到 PlayStation 4 的分享文件编辑器，请更新您的工具目录

source: Unable to find PlayStation 4 trophy editor, please update your tools directory
zh_cn: 找不到 PlayStation 4 奖杯编辑器，请更新您的工具目录

# Unable to find Xbox One tool: xce.exe Please update your tools directory
source: Unable to find Xbox One tool: xce.exe \nPlease update your tools directory
zh_cn: 无法找到 Xbox One 工具：xce.exe \n请更新你的工具目录

source: Unable to find an extension within the GMEZ file
zh_cn: 无法在该GMEZ文件中找到一个扩展

source: Unable to find certificate file '{0}'
zh_cn: 找不到证书文件 '{0}'

source: Unable to find matching pronunciation.sig file \nVoice recognition files will not be imported
zh_cn: 无法找到匹配的发音.sig 文件\n将不会导入语音识别文件

source: Unable to load
zh_cn: 无法加载

source: Unable to load {0}
zh_cn: 无法加载 {0}

source: Unable to login - failed to get a Steam session ticket
zh_cn: 无法登录 - 没能获得Steam会话凭证

source: Unable to login - no network connection
zh_cn: 无法登录 - 没有网络连接

source: Unable to login - server error, allowing offline
zh_cn: 无法登录 - 服务器错误，允许离线使用

source: Unable to read the extension file
zh_cn: 无法读取扩展文件

source: Unable to save the following files (please see the output panel for more details).
zh_cn: 无法保存下列文件（请参阅输出面板以获取更多详细信息）。

source: Unable to take user offline
zh_cn: 无法让用户离线

source: Unary (!, -, ~)
zh_cn: 一元运算符(!, -, ~)

source: Unavailable Font
zh_cn: 不可用字体

source: Unchecking this will switch this behaviour off and the compile window will on be visible if open.
zh_cn: 解除此选项则会关闭这个行为，而如果打开，编译窗口将会出现。

source: Uncomment Selection
zh_cn: 解除注释所选内容

source: Uncomment the selected line (or lines) of text
zh_cn: 解除注释所选行（或多行）的文本

source: Uncompress as zip file
zh_cn: 作为zip文件解压

source: Uncompress on Load - Not Streamed
zh_cn: 载入时非压缩 -非流式

source: Uncompressed - Not Streamed
zh_cn: 非压缩 - 非流式

source: Uncompressed sounds are those that have been saved as WAV format files, while compressed sounds can be either MP3 or OGG format.
zh_cn: 未压缩的声音是保存为 WAV 格式文件的声音，而压缩后的声音一般是 MP3 或 OGG 格式。

source: Undefined
zh_cn: 未定义（Undefined）

source: Undefined variable '{0}' referenced in room {3} in instance {1}'s variable '{2}'
zh_cn: 在房间{3}中，实例{1}的变量“{2}”中引用了未定义变量“{0}”

source: Undefined variable '{0}' referenced in {1}'s variable '{2}'
zh_cn: 在{1}的变量“{2}”中引用了未定义变量“{0}”

source: Under the colour preferences you have the different styling Options.
zh_cn: 在颜色偏好设置下，您有不同风格的 选项。

source: Undo
zh_cn: 撤消

source: Undo/Redo stack limit (<0 unlimited)
zh_cn: 撤消/重做堆栈限制（<0无限制）

source: Unfold All Regions
zh_cn: 展开所有区域

source: Unfold all regions
zh_cn: 展开所有区域

source: Unfortunately, this addon is not available for the licences you currently own.\nDo you want to go to your account to view your licences?
zh_cn: 很抱歉，这个附加组件不适用于您当前拥有的许可证。\n您要前往您的账户来查看您的许可证吗？

source: Uninstall
zh_cn: 卸载

source: Unknown
zh_cn: 未知

source: Unknown Action
zh_cn: 未知动作

source: Unknown Event
zh_cn: 未知事件

source: Unknown Shader Type '{0}' for shader '{1}'
zh_cn: 着色器“{1}”的未知着色器类型“{0}”

source: Unknown Values
zh_cn: 未知值

source: Unknown event
zh_cn: 未知事件

source: Unknown image format
zh_cn: 未知图片格式

source: Unknown moment
zh_cn: 未知时刻

source: Unless updated this will have undefined results in game.
zh_cn: 请更改深度，否则游戏中会有未定义的结果。

source: Unsafe Path
zh_cn: 非安全路径

source: Unselect All
zh_cn: 全部取消选择

source: Unsigned
zh_cn: 无符号

source: Unstage All
zh_cn: 不加载所有

source: Unstage Selected
zh_cn: 不加载所选

source: Unstaged Changes
zh_cn: 不加载变化

source: Untitled Group
zh_cn: 无标题组

source: Up
zh_cn: 上

source: Up Arrow
zh_cn: 方向键上

source: Up to date
zh_cn: 最新

source: Update
zh_cn: 更新

source: Update Available ({0})
zh_cn: 可用的更新 ({0})

source: Update Available!
zh_cn: 更新可用！

source: Update Available: {0}
zh_cn: 有可用更新： {0}

source: Update Existing Package
zh_cn: 更新现有程序包

source: Update Particle System
zh_cn: 更新粒子系统

source: Update Profile
zh_cn: 更新个人资料

source: Update the extension name
zh_cn: 更新扩展名

source: Update the particle system, advancing it another step.
zh_cn: 更新粒子系统，并前进到下一步。

source: Updated compatibility script '{0}'
zh_cn: 已更新兼容性脚本 '{0}'

source: Updating
zh_cn: 更新

source: Updating Runtime
zh_cn: 更新运行环境

source: Updating The IDE
zh_cn: 更新IDE

source: Updating...
zh_cn: 更新...

# Uploaded package '{0}' version {1} Go to the asset listing page?
source: Uploaded package '{0}' version {1}\nGo to the asset listing page?
zh_cn: 已上传程序包 '{0}' 版本 {1}\n 转到资产列表页面？

source: Uploading to Marketplace...
zh_cn: 上传到市场...

source: Use Alpha
zh_cn: 使用Alpha值

source: Use As Tileset
zh_cn: 作为图块集使用

source: Use Built-in Particles
zh_cn: 使用内置粒子

source: Use Default
zh_cn: 使用默认

source: Use Default License Agreement
zh_cn: 使用默认许可协议

source: Use Default NSIS Script
zh_cn: 使用默认NSIS安装脚本

source: Use DnD™ as default script type
zh_cn: 默认使用 DnD™ 脚本

source: Use Facebook
zh_cn: 使用Facebook

source: Use Google APK Expansion
zh_cn: 使用谷歌 APK 扩展

source: Use Google APK expansion
zh_cn: 使用谷歌 APK 扩展

source: Use Group On...
zh_cn: 将该组用于……

source: Use Mac for ADB connection
zh_cn: 使用Mac进行ADB连接

source: Use Mac of ADB connection
zh_cn: 使用Mac上的ADB连接

source: Use Mine
zh_cn: 使用我的

source: Use Range
zh_cn: 使用范围

source: Use Sandbox
zh_cn: 使用沙箱

source: Use Splash Screen
zh_cn: 使用启动画面

source: Use Test Ads
zh_cn: 使用测试广告

source: Use Theirs
zh_cn: 使用他们的

source: Use an alternative method (true) or the regular method (false).
zh_cn: 使用替代的方法（true）或者常规的方法（false）。

source: Use an external browser for help
zh_cn: 使用外部浏览器获取帮助

source: Use built-in particles
zh_cn: 使用内置粒子

source: Use compact resource tree (re-open resource tree)
zh_cn: 使用紧凑的资源树 （重新打开资源树）

source: Use splash screen
zh_cn: 使用启动画面

source: Use synchronization to avoid tearing
zh_cn: 启用垂直同步避免画面撕裂

source: Use {0}
zh_cn: 使用 {0}

source: User Event {0}
zh_cn: 用户事件 {0}

source: User Events
zh_cn: 用户事件

source: User Login
zh_cn: 用户登录

source: User Name:
zh_cn: 用户名：

source: User defined layer depths are not adequately spaced.
zh_cn: 用户定义的层的深度之间没有足够的间距。

source: User is banned
zh_cn: 用户被封禁

source: User not found
zh_cn: 未找到用户

source: Username
zh_cn: 用户名

source: Username field cannot be empty
zh_cn: 用户名字段不能为空

source: Username to commit as
zh_cn: 用于提交的用户名

source: Username/Password
zh_cn: 用户名/密码

source: Username:
zh_cn: 用户名：

source: Uses Physics
zh_cn: 使用物理

source: Using Buffers
zh_cn: 使用缓冲区

source: Using DnD™ or code to program the game is outside of the scope of this basic Quick Start guide, but you can find more information from the two pages given below:
zh_cn: 使用 DnD™ 或代码编写游戏不属于本基本快速入门指南的范围，但您可以从以下两页中找到更多信息：

source: Using symbols not found in font (?)
zh_cn: 使用这个字体没有的字符（？）

source: Using symbols nott found in font (?)
zh_cn: 没有在字体中找到所使用的符号(?)

source: Using the File Functions
zh_cn: 使用文件函数

source: Usually compilers will use an INT (an INT is usually defined as a signed 32bit number) and then simply assign it to 0 or 1.
zh_cn: 通常编译器会使用一个 INT（INT 通常定义一个有符号的 32 位数字），然后简单的赋值为 0 或 1。

source: Usually left blank
zh_cn: 通常留空

source: VAlign
zh_cn: 垂直对齐

source: VM
zh_cn: 虚拟机(VM)

source: Val
zh_cn: 亮度

source: Validation Error
zh_cn: 验证错误

source: Value
zh_cn: 值

source: Value (0-100)
zh_cn: 值 (0-100)

source: Value (any data type) or undefined (if the named variable does not exist)
zh_cn: 值（任意数据类型）或undefined（如果该名称的变量不存在）

source: Value Description
zh_cn: 值描述

source: Value:
zh_cn: 值：

source: Values
zh_cn: 值

source: Variable
zh_cn: 变量

source: Variable Definitions
zh_cn: 变量定义

source: Variable Errors
zh_cn: 变量错误

source: Variable Functions
zh_cn: 变量函数

source: Variable Length Arguments
zh_cn: 可变长度参数(?)

source: Variables
zh_cn: 变量

source: Variables And Variable Scope
zh_cn: 变量和变量的作用域

source: Vector Sprites (SWF)
zh_cn: 矢量精灵（SWF）

source: Verbose Logging
zh_cn: 记录详细日志

source: Verbose logging
zh_cn: 详细日志记录

source: Verify that you have installed this font correctly.
zh_cn: 请确认是否已正确安装此字体。

source: Verifying package...
zh_cn: 验证程序包...

source: Verifying...
zh_cn: 验证中……

source: Version
zh_cn: 版本

source: Version No.
zh_cn: 版本号

source: Version {0}.
zh_cn: 版本 {0}.

source: Version:
zh_cn: 版本：

source: Vertex Buffer Method
zh_cn: 顶点缓冲区方法(VBM)

source: Vertex Format is sealed.
zh_cn: 顶点格式被封闭。

source: Vertex Shader: {0}
zh_cn: 顶点着色器：{0}

source: Vertical
zh_cn: 垂直

source: Vertical Border
zh_cn: 垂直边界

source: Vertical Cell Offset
zh_cn: 垂直单元偏移

source: Vertical Pixel Offset
zh_cn: 垂直像素偏移

source: Vertical Scale
zh_cn: 垂直缩放

source: Vertical Scrollbar
zh_cn: 垂直滚动条

source: Vertical Separation
zh_cn: 垂直间隔

source: Vertical Separator
zh_cn: 垂直分离器

source: Vertical Shift:
zh_cn: 垂直偏移：

source: Vertical Speed
zh_cn: 垂直速度

source: Vertical Tile
zh_cn: 图块纵向平铺

source: Vertical pixel spacing
zh_cn: 垂直像素间隔

source: Very useful for sending copies to people or for saving backups.
zh_cn: 如果你想给别人发送该项目的拷贝或者保存备份的话这个选项很好用。

source: Very useful!
zh_cn: 非常有用，是吧！

source: Video URL:
zh_cn: 视频网址：

source: View
zh_cn: 视图

source: View As...
zh_cn: 视为...?

source: View History
zh_cn: 查看历史

source: View Name Already In Use
zh_cn: 视图名称已经被使用了。

source: View On Marketplace
zh_cn: 市场上查看

source: View Release notes
zh_cn: 查看版本说明

source: View Variables And Windows Functions
zh_cn: 视野变量及窗口函数

source: View in Marketplace
zh_cn: 在市场中查看

source: View in marketplace
zh_cn: 在市场中查看

source: View more from developer.
zh_cn: 从开发者处查看更多。

source: View on Marketplace
zh_cn: 市场中查看

source: View this asset's review.
zh_cn: 查看该资源的评论

source: View this asset's reviews.
zh_cn: 查看资产评论。

source: Viewport Height
zh_cn: 视口高度

source: Viewport Properties
zh_cn: 视口属性

source: Viewport Surface ID
zh_cn: 视口表面 ID

source: Viewport Surface Id
zh_cn: 视口表面 Id

source: Viewport Width
zh_cn: 视口宽度

source: Viewport X Coordinate
zh_cn: 视口X坐标

source: Viewport Y Coordinate
zh_cn: 视口Y坐标

source: Viewport {0}
zh_cn: 视口{0}

source: Viewports and Cameras
zh_cn: 视口与相机

source: Views
zh_cn: 视图

source: Views must be unique.
zh_cn: 视图必须是唯一的。

source: Views, however, govern what you see within that window, and so have another series of functions dedicated to them.
zh_cn: 而视野，给出窗口能看到什么， 所以有另外一个系列专用的函数。

source: Visibility
zh_cn: 可见性

source: Visible
zh_cn: 可见

source: Visible Layers
zh_cn: 可见图层

source: Visit https://slim.mng.nintendo.net/slim/home to create it?
zh_cn: 访问 https://slim.mng.nintendo.net/slim/home 来创建它？

source: Visit this author's page.
zh_cn: 访问作者页面。

source: Visual Studio Path
zh_cn: Visual Studio 路径

source: Visual Studio location
zh_cn: Visual Studio 位置

source: Voice Recognition
zh_cn: 语音识别

source: Volume
zh_cn: 音量

source: Volume:
zh_cn: 音量：

source: Warn when trying to Debug YYC
zh_cn: 当使用 YYC 调试时警告

source: Warning
zh_cn: 警告

source: Warning!
zh_cn: 警告！

source: Was the Merge operation successful?
zh_cn: 合并操作是否成功？

source: Watch
zh_cn: 监视

source: Watches
zh_cn: Watches（监视子画面）

source: We OR in 2, because the bit pattern 00000010 is equal to 2.
zh_cn: 我们 “或” 2，因为这个位模式 00000010 等于 2。

source: We can obviously use these operations for other things when developing our games, like masking sprites, doing integer MOD operations (using AND) or doing nice looping counters.
zh_cn: 很明显地，在开发游戏时我们可以使用这些运算做些其它的事情，像是掩蔽精灵、整数 MOD 运算（使用与）或者一个不错的循环计数器。

source: We can use set this option to simulate this effect and reduce the velocity of rotation of instances in the physics world, as, without it, any rotating instance would continue to rotate infinitely.
zh_cn: 我们可以使用set这个选项来模拟这个效果，并减少物理世界中的实例的旋转速度，因为没有它，任何旋转的实例将继续无限旋转。

source: We could set both by doing this:
zh_cn: 我们可以像这样 同时 设置它们：

source: We have also prepared a video which illustrates some of the things outlined in the above mini-tutorial:
zh_cn: 我们还准备了一段视频(YouTube)，来概括上述迷你教程中的一些事情：

source: We have also prepared a video which illustrates some of the things outlined in the mini-tutorial above:
zh_cn: 我们还准备了一段视频(YouTube)，来概括上述迷你教程中的一些事情：

source: We have set tile set size to 32px, and we have left the rest of the values at their default, since we have no need of offsets or anything like that.
zh_cn: 我们已经将图块集的大小设置为32px，并且将其余的值保持为默认值，因为我们不需要偏移或其他类似的操作。

source: We mentioned briefly above that you can dock many windows into the current workspace window and you can un-dock those that are already docked.
zh_cn: 我们上面简要提到，您可以将许多窗口 停靠 在当前的工作区中，并且可以 拆卸已经停靠 的窗口。

source: We need to assign a collision shape the object ourselves (this is properly called a fixture, see The Physics Functions for more information), which can either be a circle, a rectangle or a polygon shape that you yourself define.
zh_cn: 我们需要自己指定一个碰撞形状（这被称为夹具，详见物理功能），可以要么是你自己定义的一个圆，一个矩形或一个多边形。

source: We now have the objects to spawn instances of and their corresponding x and y spawn coordinates within the room all stored in our array.
zh_cn: 现在我们在数组储存的坐标对应的位置产生物体的实例。

source: We set the surface variable to -1, as all surface functions should really be used in the Draw events to prevent odd errors or undefined behaviours.
zh_cn: 由于所有的表面函数真正在 Draw 事件中使 用，为了防止奇怪的错误或者未定义的行为，我们设置表面变量为-1。

source: We want to clear bits 1 and 3 (giving us the value 5), but in remembering the truth table above, what we want to do is keep all the other bits, and clear bits 1 and 3.
zh_cn: 我们要清除位 1 和位 3（值等于 5），但是记一下上面的真值表，我们要的是保留其它的位，清除位 1 和位 3。

source: We won't go through all the events here, but we will cover the five most important ones briefly:
zh_cn: 我们不会在这里介绍所有种类的事件，但我们会简要地介绍五个最重要的事件：

source: We'll discuss a few other features of the sprite editor that are important to know when just getting started...
zh_cn: 我们将讨论精灵编辑器的一些其他功能，这些功能的了解对于刚入门时很重要。

source: We'll illustrate this with one final example...
zh_cn: 我们将用一个最后的例子说明这一点...

source: We'll start this section of the Quick Start Guide by looking at sprites which are generally one of the first things you'll need when making any project in GameMaker Studio 2.
zh_cn: 我们将通过介绍在 GameMaker Studio 2 中制作任何项目都需要的第一个资源 - 精灵 来开始“快速入门指南”的这部分内容。

source: We've mentioned that there are different layer types, so let's just go over what they are and how they can be used when building your games:
zh_cn: 我们之前提到了不同的层类型，现在让我们来看看它们是什么以及在构建游戏时如何使用它们：

source: Web
zh_cn: Web（网页端）

source: Webserver Port
zh_cn: Web服务器端口

source: Webserver Port Unavailable
zh_cn: Web服务器端口不可用

source: Webserver Port:
zh_cn: Web服务器端口：

source: Welcome
zh_cn: 欢迎

source: Welcome Page
zh_cn: 欢迎页

source: Welcome to the GameMaker Studio 2 user manual!
zh_cn: 欢迎使用 GameMaker Studio 2 用户手册！

source: Well a single binary number can only store a 0 or 1, and that's it, so for more complex numbers we need to add bits together.
zh_cn: 单个二进制数只能存储 0 或 1，只能这样，所以复杂的数字需要添加位数。
